In [1]:
# Add dependency
import pandas as pd
import numpy as np

In [2]:
# File to Load
file_to_load = "Resources/Testing_Resources.csv"

# Read the csv into a DataFrame
missing_df =pd.read_csv(file_to_load)

missing_df

   ID    Name   Age Gender
0   1   Alice  30.0      F
1   2    John  45.0    NaN
2   3     May  35.0    NaN
3   4  Ronald   NaN      M

In [3]:
missing_df.dtypes

ID          int64
Name       object
Age       float64
Gender     object
dtype: object

In [5]:
missing_df=missing_df.dropna()
missing_df

   ID   Name   Age Gender
0   1  Alice  30.0      F